#+TITLE: Readme

You might want to edit EDN files and see how that looks. If so, run

#+begin_src
bin/live-server
#+end_src

and

#+begin_src
bin/watch
#+end_src

. That should start a web browser for you.

You can view the live server directly on a mobile device, just find the local
network IP of the computer you're using.

#+begin_src
$ ifconfig -a | grep wlp0s20f3 -A 5
wlp0s20f3: flags=4163<UP,BROADCAST,RUNNING,MULTICAST>  mtu 1500
        inet 192.168.1.160  netmask 255.255.255.0  broadcast 192.168.1.255
        inet6 fe80::6311:d04f:5525:23cb  prefixlen 64  scopeid 0x20<link>
        ether 50:eb:71:43:0d:c8  txqueuelen 1000  (Ethernet)
        RX packets 929092  bytes 1253081171 (1.2 GB)
        RX errors 0  dropped 0  overruns 0  frame 0
#+end_src

Right now, I'm 192.168.1.160. That means I can view http://192.168.1.160:8080 on
my phone.
* wats 2021-07-15
1. I want to be able to hit the buttons from the index page
2. I want prettier documents
** stp1
Now?

What pains me most is the horrendous navigation. And why does the root page
scroll on mobile?
** Happening? No.
Infinite malleability.

I need a nice orange for contrast to the green, nice warm orange.
** golden ratio
Golden ratio: 1.618

1. B/A = f
2. A = 1
3. B = f
4. A + B = 1 + f
5. A (prosent): 1 / (1 + f) * 100
6. B (prosent): f / (1 + f) * 100

#+begin_src python :exports both
f = 1.618

return {"a": 1 / (1 + f) * 100,
        "b": f / (1 + f) * 100}
#+end_src

#+RESULTS:
| a | : | 38.19709702062642 | b | : | 61.80290297937356 |

38, 62

#+begin_src emacs-lisp :exports both
(let ((f 1.618))
  (list (* (/ 1 (+ 1 f)) 100)
        (* (/ f (+ 1 f)) 100)))
#+end_src

#+RESULTS:
| 38.19709702062642 | 61.80290297937356 |
** design?
I feel like I'm approaching a place where I can /play/ with styles. Still don't
feel like I'm /doing/ design.
* wats 2021-07-14
Ideas:

1. Metadata on toplevel EDN to hook into builder
2. Metadata or HTML elements or EDN readers to transform

NOW: can an EDN file have metadata? That would be nice.

#+begin_src clojure
{:eu.teod.subcons/builder :eu.teod.subcons.builder/hiccup-html}
#+end_src

